# Salary Datasets

In [157]:
import pandas as pd

In [158]:
df= pd.read_csv("degrees-that-pay-back.csv")

## Understanding Data(major)

In [159]:
df.shape

(50, 8)

In [160]:
df.dtypes

Undergraduate Major                                   object
Starting Median Salary                                object
Mid-Career Median Salary                              object
Percent change from Starting to Mid-Career Salary    float64
Mid-Career 10th Percentile Salary                     object
Mid-Career 25th Percentile Salary                     object
Mid-Career 75th Percentile Salary                     object
Mid-Career 90th Percentile Salary                     object
dtype: object

In [161]:
df.isnull().sum()

Undergraduate Major                                  0
Starting Median Salary                               0
Mid-Career Median Salary                             0
Percent change from Starting to Mid-Career Salary    0
Mid-Career 10th Percentile Salary                    0
Mid-Career 25th Percentile Salary                    0
Mid-Career 75th Percentile Salary                    0
Mid-Career 90th Percentile Salary                    0
dtype: int64

In [162]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Percent change from Starting to Mid-Career Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Accounting,"$46,000.00","$77,100.00",67.6,"$42,200.00","$56,100.00","$108,000.00","$152,000.00"
1,Aerospace Engineering,"$57,700.00","$101,000.00",75.0,"$64,300.00","$82,100.00","$127,000.00","$161,000.00"
2,Agriculture,"$42,600.00","$71,900.00",68.8,"$36,300.00","$52,100.00","$96,300.00","$150,000.00"
3,Anthropology,"$36,800.00","$61,500.00",67.1,"$33,800.00","$45,500.00","$89,300.00","$138,000.00"
4,Architecture,"$41,600.00","$76,800.00",84.6,"$50,600.00","$62,200.00","$97,000.00","$136,000.00"

### Information:

|field name|unit|meaning|type|
|----------|----|-------|----|
|Undergraduate Major |||object|
|Starting Median Salary|U.S dollar|the median salary at the beginning of the career|object|
|Mid-Career Median Salary|U.S dollar|the median salary at the middle career|object|
|Percent change from Starting to Mid-Career Salary|%||object|
|Mid-Career 10th Percentile Salary|U.S dollar|the salary higher than first 10% of workers at the middle career |float64|
|Mid-Career 25th Percentile Salary|U.S dollar|the salary higher than first 25% of workers at the middle career|object|
|Mid-Career 75th Percentile Salary|U.S dollar|the salary higher than first 75% of workers at the middle career|object|
|Mid-Career 90th Percentile Salary|U.S dollar|the salary higher than first 90% of workers at the middle career|object|

## Data cleaning

In [163]:
df.columns=["Major","str_50","mid_50","percentage_str_to_mid","mid_10","mid_25","mid_75","mid_90"]
col=["str_50","mid_50","mid_10","mid_25","mid_75","mid_90"]

for x in col:
    df[x]=df[x].str.replace('$','')
    df[x]=df[x].str.replace(',','')
    df[x]=pd.to_numeric(df[x])

df.head()

,Major,str_50,mid_50,percentage_str_to_mid,mid_10,mid_25,mid_75,mid_90
0,Accounting,46000.0,77100.0,67.6,42200.0,56100.0,108000.0,152000.0
1,Aerospace Engineering,57700.0,101000.0,75.0,64300.0,82100.0,127000.0,161000.0
2,Agriculture,42600.0,71900.0,68.8,36300.0,52100.0,96300.0,150000.0
3,Anthropology,36800.0,61500.0,67.1,33800.0,45500.0,89300.0,138000.0
4,Architecture,41600.0,76800.0,84.6,50600.0,62200.0,97000.0,136000.0

In [164]:
df.to_csv('Clean_pay_back_Data.csv')

## Data(region)

In [165]:
df1 = pd.read_csv('salaries-by-region.csv')

In [166]:
df1.dtypes

School Name                          object
Region                               object
Starting Median Salary               object
Mid-Career Median Salary             object
Mid-Career 10th Percentile Salary    object
Mid-Career 25th Percentile Salary    object
Mid-Career 75th Percentile Salary    object
Mid-Career 90th Percentile Salary    object
dtype: object

In [167]:
df1.shape

(320, 8)

In [168]:
df1.isnull().sum()

School Name                           0
Region                                0
Starting Median Salary                0
Mid-Career Median Salary              0
Mid-Career 10th Percentile Salary    47
Mid-Career 25th Percentile Salary     0
Mid-Career 75th Percentile Salary     0
Mid-Career 90th Percentile Salary    47
dtype: int64

In [169]:
df1.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

|field name|unit|meaning|type|
|----------|----|-------|----|
|School name|||object|
|Region||the region of school located|object|
|Starting Median Salary|U.S dollar|the median salary at the beginning of the career|object|
|Mid-Career Median Salary|U.S dollar|the median salary at the middle career|object|
|Mid-Career 10th Percentile Salary|U.S dollar|the salary higher than first 10% of workers at the middle career |float64|
|Mid-Career 25th Percentile Salary|U.S dollar|the salary higher than first 25% of workers at the middle career|object|
|Mid-Career 75th Percentile Salary|U.S dollar|the salary higher than first 75% of workers at the middle career|object|
|Mid-Career 90th Percentile Salary|U.S dollar|the salary higher than first 90% of workers at the middle career|object|

## Data Cleaning

In [170]:
df1=df1.dropna()

In [171]:
df1.shape

(273, 8)

In [172]:
df1.columns=["Name","Region","str_50","mid_50","mid_10","mid_25","mid_75","mid_90"]
col1=["str_50","mid_50","mid_10","mid_25","mid_75","mid_90"]

for x in col1:
    df1[x]=df1[x].str.replace('$','')
    df1[x]=df1[x].str.replace(',','')
    df1[x]=pd.to_numeric(df1[x])

In [173]:
df1.to_csv('Clean_region_Data.csv')

## Data(school type)

In [174]:
df2=pd.read_csv('salaries-by-college-type.csv')

In [175]:
df2.isnull().sum()

School Name                           0
School Type                           0
Starting Median Salary                0
Mid-Career Median Salary              0
Mid-Career 10th Percentile Salary    38
Mid-Career 25th Percentile Salary     0
Mid-Career 75th Percentile Salary     0
Mid-Career 90th Percentile Salary    38
dtype: int64

In [176]:
df2.dtypes

School Name                          object
School Type                          object
Starting Median Salary               object
Mid-Career Median Salary             object
Mid-Career 10th Percentile Salary    object
Mid-Career 25th Percentile Salary    object
Mid-Career 75th Percentile Salary    object
Mid-Career 90th Percentile Salary    object
dtype: object

In [177]:
df.shape

(50, 8)

In [178]:
df2.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00","$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,Engineering,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00","$66,800.00","$94,300.00","$143,000.00","$190,000.00"
4,Cooper Union,Engineering,"$62,200.00","$114,000.00",NaN,"$80,200.00","$142,000.00",NaN

### Information

|field name|unit|meaning|type|
|----------|----|-------|----|
|School name|||object|
|school type||eg. Engineering, State|object|
|Starting Median Salary|U.S dollar|the median salary at the beginning of the career|object|
|Mid-Career Median Salary|U.S dollar|the median salary at the middle career|object|
|Mid-Career 10th Percentile Salary|U.S dollar|the salary higher than first 10% of workers at the middle career |float64|
|Mid-Career 25th Percentile Salary|U.S dollar|the salary higher than first 25% of workers at the middle career|object|
|Mid-Career 75th Percentile Salary|U.S dollar|the salary higher than first 75% of workers at the middle career|object|
|Mid-Career 90th Percentile Salary|U.S dollar|the salary higher than first 90% of workers at the middle career|object|

## Data Cleaning

In [179]:
df2=df2.dropna()

In [180]:
df2.columns=["Name","Type","str_50","mid_50","mid_10","mid_25","mid_75","mid_90"]
col2=["str_50","mid_50","mid_10","mid_25","mid_75","mid_90"]

for x in col2:
    df2[x]=df2[x].str.replace('$','')
    df2[x]=df2[x].str.replace(',','')
    df2[x]=pd.to_numeric(df2[x])

In [181]:
df2.to_csv('Clean_college_Data')

In [182]:
data1= pd.read_csv('Clean_college_Data')
data2= pd.read_csv('Clean_region_Data')
data3=pd.read_csv('Clean_pay_back_Data')

In [186]:
data4=pd.merge(data1,data2,on=['Name'],how='inner')
result = pd.concat([data4, data3], axis=1, sort=False)
result.to_csv('projectdata_salary.csv')

In [187]:
import pandas as pd
df5 = pd.read_csv('projectdata_salary.csv')

In [188]:
df6=df5.drop(columns=['Unnamed: 0', 'Unnamed: 0_x','Unnamed: 0.1','Unnamed: 0_y'])

In [189]:
df6.to_csv("Project1_salary.csv")

## Understaning combined data

In [190]:
import pandas as pd

import numpy as np

data=pd.read_csv('Project1_salary')

In [191]:
del data['Unnamed: 0']

In [192]:
data.columns=["Name","Type","str_50_type","mid_50_type","mid_10_type","mid_25_type","mid_75_type","mid_90_type","Region","str_50_region","mid_50_region","mid_10_region","mid_25_region","mid_75_region","mid_90_region","Major","str_50_major","mid_50_major","percentage_str_to_mid_major","mid_10_major","mid_25","mid_75_major","mid_90_major"]

In [193]:
data.shape

(224, 23)

In [194]:
data.dtypes

Name                            object
Type                            object
str_50_type                    float64
mid_50_type                    float64
mid_10_type                    float64
mid_25_type                    float64
mid_75_type                    float64
mid_90_type                    float64
Region                          object
str_50_region                  float64
mid_50_region                  float64
mid_10_region                  float64
mid_25_region                  float64
mid_75_region                  float64
mid_90_region                  float64
Major                           object
str_50_major                   float64
mid_50_major                   float64
percentage_str_to_mid_major    float64
mid_10_major                   float64
mid_25                         float64
mid_75_major                   float64
mid_90_major                   float64
dtype: object

In [195]:
data.describe()

,str_50_type,mid_50_type,mid_10_type,mid_25_type,mid_75_type,mid_90_type,str_50_region,mid_50_region,mid_10_region,mid_25_region,mid_75_region,mid_90_region,str_50_major,mid_50_major,percentage_str_to_mid_major,mid_10_major,mid_25,mid_75_major,mid_90_major
count,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000,50.000000,50.00000,50.000000,50.000000,50.000000,50.000000,50.000000
mean,45974.107143,83264.285714,44635.267857,60288.392857,114130.357143,158899.553571,45974.107143,83263.839286,44635.267857,60288.392857,114130.357143,158899.553571,44310.000000,74786.00000,69.274000,43408.000000,55988.000000,102138.000000,142766.000000
std,6085.213211,13633.471454,8452.815856,10569.914539,21240.019927,34446.349391,6085.213211,13633.307456,8452.815856,10569.914539,21240.019927,34446.349391,9360.866217,16088.40386,17.909908,12000.779567,13936.951911,20636.789914,27851.249267
min,34800.000000,58200.000000,25600.000000,40500.000000,72000.000000,91300.000000,34800.000000,58200.000000,25600.000000,40500.000000,72000.000000,91300.000000,34000.000000,52000.00000,23.400000,26700.000000,36500.000000,70500.000000,96400.000000
25%,42100.000000,73400.000000,39450.000000,53200.000000,100000.000000,137000.000000,42100.000000,73400.000000,39450.000000,53200.000000,100000.000000,137000.000000,37050.000000,60825.00000,59.125000,34825.000000,44975.000000,83275.000000,124250.000000
50%,44800.000000,81450.000000,43150.000000,58050.000000,111000.000000,153000.000000,44800.000000,81450.000000,43150.000000,58050.000000,111000.000000,153000.000000,40850.000000,72000.00000,67.800000,39400.000000,52450.000000,99400.000000,145500.000000
75%,47800.000000,87950.000000,47500.000000,63125.000000,121000.000000,172000.000000,47800.000000,87950.000000,47500.000000,63125.000000,121000.000000,172000.000000,49875.000000,88750.00000,82.425000,49850.000000,63700.000000,118750.000000,161750.000000
max,72200.000000,134000.000000,80000.000000,100000.000000,234000.000000,326000.000000,72200.000000,134000.000000,80000.000000,100000.000000,234000.000000,326000.000000,74300.000000,107000.00000,103.500000,71900.000000,87300.000000,145000.000000,210000.000000

In [196]:
data.to_csv("project1_salary(clean).csv")

In [197]:
data=pd.read_csv('project1_salary(clean).csv')

## Analysis

In [198]:
outcome1=data.groupby('Type')['str_50_type'].mean().reset_index()
outcome2=data.groupby('Type')['mid_50_type'].mean().reset_index()

In [199]:
pd.merge(outcome1,outcome2,on=['Type'],how='inner').assign(ratio = lambda x: 
(x['mid_50_type']-
x['str_50_type'])/x['str_50_type']).sort_values(by='ratio',ascending=False)

           Type   str_50_type    mid_50_type     ratio
1    Ivy League  60475.000000  120125.000000  0.986358
2  Liberal Arts  46171.428571   89635.714286  0.941368
3         Party  45878.947368   84742.105263  0.847080
4         State  44304.142012   79202.958580  0.787710
0   Engineering  57778.571429  102850.000000  0.780072

In [200]:
outcome3=data.groupby('Region')['str_50_type'].mean().reset_index()
outcome4=data.groupby('Region')['mid_50_type'].mean().reset_index()

In [201]:
pd.merge(outcome3,outcome4,on=['Region'],how='inner').assign(ratio = lambda x: 
(x['mid_50_type']-
x['str_50_type'])/x['str_50_type']).sort_values(by='ratio',ascending=False)

         Region   str_50_type   mid_50_type     ratio
2  Northeastern  49823.076923  93603.846154  0.878725
0    California  48900.000000  89723.809524  0.834843
3      Southern  44246.031746  79538.095238  0.797632
4       Western  44651.612903  79590.322581  0.782474
1    Midwestern  44014.035088  77568.421053  0.762357

In [202]:
outcome5=data.groupby('Major')['str_50_type'].mean().reset_index()
outcome6=data.groupby('Major')['mid_50_type'].mean().reset_index()

In [203]:
outcome5.head(5)

                   Major  str_50_type
0             Accounting      72200.0
1  Aerospace Engineering      62400.0
2            Agriculture      61000.0
3           Anthropology      61800.0
4           Architecture      61100.0

In [204]:
outcome6.head(5)

                   Major  mid_50_type
0             Accounting     126000.0
1  Aerospace Engineering     114000.0
2            Agriculture     114000.0
3           Anthropology     111000.0
4           Architecture     110000.0

In [205]:
pd.merge(outcome5,outcome6,on=['Major'],how='inner')
outcome7=data.groupby(data['Major'])['percentage_str_to_mid_major'].mean()

result2=pd.merge(outcome5,outcome6,on=['Major'],how='inner')
pd.merge(result2,outcome7,on=
['Major'],how='inner').sort_values(by='percentage_str_to_mid_major', ascending = 
False).head(10)

,Major,str_50_type,mid_50_type,percentage_str_to_mid_major
37,Math,44700.0,83900.0,103.5
42,Philosophy,41800.0,78300.0,103.5
33,International Relations,47400.0,84100.0,97.8
17,Economics,52000.0,95000.0,96.8
36,Marketing,44700.0,83900.0,95.1
44,Physics,43100.0,78100.0,93.4
45,Political Science,43100.0,78100.0,91.7
9,Chemistry,53000.0,96700.0,87.6
34,Journalism,46300.0,84000.0,87.4
4,Architecture,61100.0,110000.0,84.6

In [206]:
pd.merge(result2,outcome7,on=
['Major'],how='inner').sort_values(by='percentage_str_to_mid_major', ascending = 
False).tail(10)

,Major,str_50_type,mid_50_type,percentage_str_to_mid_major
49,Spanish,42200.0,73400.0,56.2
39,Music,41300.0,81400.0,53.2
47,Religion,43800.0,74600.0,52.5
31,Information Technology (IT),49900.0,85700.0,52.3
29,Hospitality & Tourism,44100.0,86000.0,52.1
18,Education,50500.0,95000.0,49.0
32,Interior Design,47400.0,84100.0,47.4
41,Nutrition,41400.0,79700.0,38.6
40,Nursing,41400.0,79700.0,23.6
43,Physician Assistant,41800.0,78300.0,23.4